# Googling how to do something is NOT cheating. 
# Googling how to do figure something out is ENCOURAGED.

## #1 Figure out how to print the current date and time. 
The solution should be in this format:  2021-08-05 11:56:30 (YYYY-MM-DD HH:MM:SS)

Hint:  You're going to have to import a library

In [2]:
from datetime import datetime

print(datetime.now()) # Need to better format the second

2025-08-05 20:37:31.388267

## #2 Write a function that accepts the radius of a circle and returns the area of a circle.  
The function for the area of a circle is pi * radius squared.

In [1]:
import math

def circle_area(rad):
    return math.pi * (rad * rad)

## #3 Write a function that takes a list of numbers and returns True of all number in the list are unique and returns False if the list contains duplicate numbers. 
* Hint, maybe think of using a set()

Input:  input_list = [2,4,5,5,7,9]

Expected Output:  False

In [ ]:
def check_duplicates(num_list):
    num_set = set(num_list) # Convert the list into set
    return len(num_list) == len(num_set) # Check is their lenth is same, it will not be same if there are duplicates. Since set cannot have duplicates

## #4 Write a Python program to count the number of each character of a given text of a text file.
* Use the text file called 'lil-wayne.txt' in the data folder.  
* Convert all the characters to uppercase first, then count them.  
* Use a dictionary in which the keys of the dictionary are the characters, and the values are the counts of that character. 

Expected Result:  `{'D': 74, 'W': 63, 'A': 211, 'Y': 44, 'N': 165, 'E': 274, ' ': 522, 'M': 77, 'I': 185, 'C': 60, 'H': 122, 'L': 126, 'R': 152, 'T': 180, 'J': 8, '.': 26, '(': 12, 'B': 59, 'O': 145, 'S': 152, 'P': 39, '2': 24, '7': 7, ',': 37, '1': 28, '9': 16, '8': 6, ')': 12, '[': 14, ']': 14, 'K': 13, 'F': 44, 'G': 53, 'X': 5, 'U': 66, 'V': 20, '3': 2, '4': 4, '5': 5, '6': 3, '0': 36, '\n': 6, '-': 6, ';': 1, '!': 1, '"': 8, "'": 3, '—': 1}`

In [2]:
# Read from the file
with open("data/lil-wayne.txt", "r") as file:
    content = file.read()

upper_content = content.upper()
char_dict = {}

for char in upper_content:
    if char not in char_dict:
        char_dict[char] = 1
    else:
        char_dict[char] += 1

print(char_dict)

{'D': 74, 'W': 63, 'A': 211, 'Y': 44, 'N': 165, 'E': 274, ' ': 522, 'M': 77, 'I': 185, 'C': 60, 'H': 122, 'L': 126, 'R': 152, 'T': 180, 'J': 8, '.': 26, '(': 12, 'B': 59, 'O': 145, 'S': 152, 'P': 39, '2': 24, '7': 7, ',': 37, '1': 28, '9': 16, '8': 6, ')': 12, '[': 14, ']': 14, 'K': 13, 'F': 44, 'G': 53, 'X': 5, 'U': 66, 'V': 20, '3': 2, '4': 4, '5': 5, '6': 3, '0': 36, '\n': 6, '-': 6, ';': 1, '!': 1, '—': 1}

# 4.5 Figure out how to sort the dictionary to find which character appears the most.

In [10]:
# I found this sorting method on Stack Overflow. It sorts the dictionary from lowest to highest value
sorted_dict = {k: v for k, v in sorted(char_dict.items(), key=lambda item: item[1])}

# The last item has the highest value, so we get that
most_common_char = list(sorted_dict.items())[-1]

print("Most common character:", most_common_char[0])
print("It appears", most_common_char[1], "times")

# The most common character was a space " ". If we want an actual letter or symbol, we can get the second one from the end

Most common character:
It appears 522 times

## #5 Using the list below...
* Remove the fourth number from the list.
* Take that number you just removed and multiply the last number of the list by that number. 
* Append that number to the end of the list.
* Print the list

INPUT: [1, 1, 2, 3, 5, 8, 13, 21]

EXPECTED OUTPUT:  [1, 1, 2, 5, 8, 13, 21, 63]

In [12]:
list1 = [1, 1, 2, 3, 5, 8, 13, 21]

fourth_num = list1.pop(3)

list1.append(list1[-1] * fourth_num)

print(list1)

[1, 1, 2, 5, 8, 13, 21, 63]

## #6 Using the list below, make a new list that contains only the numbers from the original list that are divisible by three.

* Input:  original_list = [2, 3, 6, 8, 9, 15, 19, 21]
* Expected new list:  [3, 6, 9, 15, 21]

In [13]:
original_list = [2, 3, 6, 8, 9, 15, 19, 21]
new_list = []

for num in original_list:
    if num%3 == 0:
        new_list.append(num)

print(new_list)

[3, 6, 9, 15, 21]

## #7 Reverse the list below

In [ ]:
original_list = [2, 3, 6, 8, 9, 15, 19, 21]
original_list.reverse() # This is an inplace fuction
print(original_list)

[21, 19, 15, 9, 8, 6, 3, 2]

## #8 Using the list below, turn every item of the list into its square.  
* Input original_list = [1, 2, 3, 4, 5, 6, 7]
* Expected new_list:  [1, 4, 9, 16, 25, 36, 49]

In [15]:
original_list = [1, 2, 3, 4, 5, 6, 7]

for i in range(len(original_list)):
    original_list[i] = original_list[i] ** 2

print(original_list)

[1, 4, 9, 16, 25, 36, 49]

## #9  Given a two Python list. Iterate both lists simultaneously such that list1 should display item in original order and list2 in reverse order.
Given input:
```
list1 = [10, 20, 30, 40]
list2 = [100, 200, 300, 400]
```

Expected Output:
```
10 400
20 300
30 200
40 100
```

In [19]:
list1 = [10, 20, 30, 40]
list2 = [100, 200, 300, 400]

for i in range(len(list1)): #Assuming both list are same lenth
    print(list1[i], list2[-(i + 1)])

10 400
20 300
30 200
40 100

## #10 Remove empty strings from the list of strings.
Input:  `list_of_strings = ['I', 'love', '', '', 'data', '', 'science', '!']`

Expected Output:  `['I', 'love', 'data', 'science', '!']`

In [ ]:
list_of_strings = ['I', 'love', '', '', 'data', '', 'science', '!']

for str in list_of_strings[:]: # We have to use a copy of the original list. Since its dangerous to make changes inside the list while iterating
    if str == "":
        list_of_strings.remove(str)

print(list_of_strings)

['I', 'love', 'data', 'science', '!']

##  #11 Check if the value 999 exists in the dicitionary below.  If so, print true, if not print false.

Input: sample_dict = {'a': 100, 'b': 999, 'c': 300}

Expected Output:  True

In [29]:
sample_dict = {'a': 100, 'b': 999, 'c': 300}

if 999 in sample_dict.values():
    print(True)
else:
    print(False)

True

# #12 Fix all the follow broken code snippets below
(I got these examples from a great website, I will reference them later because they have the answers on them.)

In [ ]:
greeting = "Hello, possible pirate! What's the password?"
password = 'admin'
message = greeting+password

if password == "Arrr!":
    print("Go away, pirate.")
else:
    print("Greetings, hater of pirates!")

In [ ]:
pages = 457
word_per_page = 250
number_of_pieces = 100

each_chunk = (pages * word_per_page)/number_of_pieces
print(each_chunk)

# Extra Credit

## Using pandas, read the csv file in the data folder called `titianic.csv` and store it as a variable named `df`.

In [ ]:
# I took a Data Science course at Brooklyn College. It's great that I am refreshing my memory

import pandas as pd
df = pd.read_csv("/workspaces/Saifuzzaman_Tanim_2025-python-summer-prep/Week-03/intermediate/data/titanic.csv")

df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## I know we didn't cover this, but figure out how to find the mean age of the age column in your dataframe.

In [37]:
print(df["age"].mean())

29.69911764705882

## What was the oldest and youngest ages on the titanic?

In [38]:
print("Youngest:", df["age"].min())
print("Oldest:", df["age"].max())

Youngest: 0.42
Oldest: 80.0

## How many people embarked from station 'S'?

In [48]:
df[df["embarked"] == 'S']["embarked"].value_counts()

embarked
S    644
Name: count, dtype: int64